# Найти из двух чисел большее 
a = int(input("Введите число a4: "))
b = int(input("Введите число b: "))
if a > b:
    print(f"Число а= {a} большее")
elif a == b:
    print("Чиcла равны")
else:
    print(f"Число b= {b} большее")
