# Определить индексы элементов массива (списка),
# значения которых принадлежат заданному диапазону (т.е. не
# меньше заданного минимума и не больше заданного
# максимума)
# Ввод: [-5, 9, 0, 3, -1, -2, 1,
# 4, -2, 10, 2, 0, -9, 8, 10, -9,
# 0, -5, -5, 7]
# Вывод: [1, 9, 13, 14, 19]

ar = [-5, 9, 0, 3, -1, -2, 1, 4, -2, 10, 2, 0, -9, 8, 10, -9, 0, -5, -5, 7]
min_num = int(input("Введите минимальное значения: "))
max_num = int(input("Введите максимальное значение: "))

def search_index_num(array:list, min:int, max:int):
    res = []
    for i in range(len(array)):
        if min <= array[i] <= max:
            res.append(i)
    return res

print(search_index_num(ar, min_num, max_num))