'''
Найдите сумму цифр трехзначного числа.

*Пример:*

123 -> 6 (1 + 2 + 3)
100 -> 1 (1 + 0 + 0) 
'''

x = input()

print(int(x[0]) + int(x[1]) + int(x[2]))

x = int(x)

x1 = x // 100
x2 = x // 10 % 10 
x3 = x % 10
print(x1 + x2 + x3)